{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/guslipkin/Documents/Fall2020/QMB 3200 ~ Advanced Quantitative Methods/Assignment 6/idk.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}16 Oct 2020, 11:57:23

{com}. *1

. tabulate female supplement, summarize(days)

            {txt}Means, Standard Deviations and Frequencies of Days

           {c |}     Supplement
    Female {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res} 5.9333333  2.4666667 {txt}{c |}{res}       4.2
           {txt}{c |}{res} 3.8446004  3.2263794 {txt}{c |}{res} 3.9075524
           {txt}{c |}{res}        15         15 {txt}{c |}{res}        30
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         1 {c |}{res} 4.6666667  2.6666667 {txt}{c |}{res} 3.6666667
           {txt}{c |}{res} 4.5617457  3.9761192 {txt}{c |}{res} 4.3258113
           {txt}{c |}{res}        15         15 {txt}{c |}{res}        30
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}       5.3  2.5666667 {txt}{c |}{res} 3.9333333
           {txt}{c |}{res} 4.1948244  3.5591876 {txt}{c |}{res} 4.0957467
           {txt}{c |}{res}        30         30 {txt}{c |}{res}        60

{com}. tabulate female supplement, summarize(cold)

            {txt}Means, Standard Deviations and Frequencies of Cold

           {c |}     Supplement
    Female {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res} .73333333         .4 {txt}{c |}{res} .56666667
           {txt}{c |}{res} .45773771  .50709255 {txt}{c |}{res} .50400693
           {txt}{c |}{res}        15         15 {txt}{c |}{res}        30
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         1 {c |}{res} .53333333  .33333333 {txt}{c |}{res} .43333333
           {txt}{c |}{res} .51639778  .48795004 {txt}{c |}{res} .50400693
           {txt}{c |}{res}        15         15 {txt}{c |}{res}        30
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res} .63333333  .36666667 {txt}{c |}{res}        .5
           {txt}{c |}{res} .49013252  .49013252 {txt}{c |}{res} .50421948
           {txt}{c |}{res}        30         30 {txt}{c |}{res}        60

{com}. 
. *2a

. *prtest cold==supplement

. *2b

. *prtest cold==supplement if female==0

. *prtest cold==supplement if female==1

. *2c

. *prtest cold==female

. *2d

. *prtest cold==female if supplement==0

. *prtest cold==female if supplement==1

. 
. *2a

. prtest cold, by(supplement)

{txt}Two-sample test of proportions                     {res}0{txt}: Number of obs = {res}      30
                                                   1{txt}: Number of obs = {res}      30
{txt}{hline 13}{c TT}{hline 64}
       Group{col 14}{c |}{col 22}Mean{col 29}Std. Err.{col 44}z{col 49}P>|z|{col 59}[95% Conf. Interval]
{hline 13}{c +}{hline 64}
           0 {c |}{res}{col 17} .6333333{col 28} .0879815{col 58} .4608928{col 70} .8057739
           {txt}1 {c |}{res}{col 17} .3666667{col 28} .0879815{col 58} .1942261{col 70} .5391072
{txt}{hline 13}{c +}{hline 64}
        diff {c |}{res}{col 17} .2666667{col 28} .1244246{col 58} .0227989{col 70} .5105344
{txt}{col 14}{c |}{col 17}under Ho:{res}{col 28} .1290994{col 38}    2.07{col 49}0.039
{txt}{hline 13}{c BT}{hline 64}
        diff = prop({res}0{txt}) - prop({res}1{txt})                                  z = {res}  2.0656
{txt}    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = {res}0.9806         {txt}Pr(|Z| > |z|) = {res}0.0389          {txt}Pr(Z > z) = {res}0.0194

{com}. *2b

. by female, sort : prtest cold == supplement

{txt}{hline}
-> female = 0

Two-sample test of proportions                  {res}cold{txt}: Number of obs = {res}      30
                                          supplement{txt}: Number of obs = {res}      30
{txt}{hline 13}{c TT}{hline 64}
    Variable{col 14}{c |}{col 22}Mean{col 29}Std. Err.{col 44}z{col 49}P>|z|{col 59}[95% Conf. Interval]
{hline 13}{c +}{hline 64}
        cold {c |}{res}{col 17} .5666667{col 28}  .090472{col 58} .3893448{col 70} .7439886
  {txt}supplement {c |}{res}{col 17}       .5{col 28} .0912871{col 58} .3210806{col 70} .6789194
{txt}{hline 13}{c +}{hline 64}
        diff {c |}{res}{col 17} .0666667{col 28} .1285244{col 58}-.1852365{col 70} .3185698
{txt}{col 14}{c |}{col 17}under Ho:{res}{col 28} .1288122{col 38}    0.52{col 49}0.605
{txt}{hline 13}{c BT}{hline 64}
        diff = prop({res}cold{txt}) - prop({res}supplement{txt})                      z = {res}  0.5175
{txt}    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = {res}0.6976         {txt}Pr(|Z| > |z|) = {res}0.6048          {txt}Pr(Z > z) = {res}0.3024

{txt}{hline}
-> female = 1

Two-sample test of proportions                  {res}cold{txt}: Number of obs = {res}      30
                                          supplement{txt}: Number of obs = {res}      30
{txt}{hline 13}{c TT}{hline 64}
    Variable{col 14}{c |}{col 22}Mean{col 29}Std. Err.{col 44}z{col 49}P>|z|{col 59}[95% Conf. Interval]
{hline 13}{c +}{hline 64}
        cold {c |}{res}{col 17} .4333333{col 28}  .090472{col 58} .2560114{col 70} .6106552
  {txt}supplement {c |}{res}{col 17}       .5{col 28} .0912871{col 58} .3210806{col 70} .6789194
{txt}{hline 13}{c +}{hline 64}
        diff {c |}{res}{col 17}-.0666667{col 28} .1285244{col 58}-.3185698{col 70} .1852365
{txt}{col 14}{c |}{col 17}under Ho:{res}{col 28} .1288122{col 38}   -0.52{col 49}0.605
{txt}{hline 13}{c BT}{hline 64}
        diff = prop({res}cold{txt}) - prop({res}supplement{txt})                      z = {res} -0.5175
{txt}    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = {res}0.3024         {txt}Pr(|Z| > |z|) = {res}0.6048          {txt}Pr(Z > z) = {res}0.6976

{com}. *2c

. prtest cold, by(female)

{txt}Two-sample test of proportions                     {res}0{txt}: Number of obs = {res}      30
                                                   1{txt}: Number of obs = {res}      30
{txt}{hline 13}{c TT}{hline 64}
       Group{col 14}{c |}{col 22}Mean{col 29}Std. Err.{col 44}z{col 49}P>|z|{col 59}[95% Conf. Interval]
{hline 13}{c +}{hline 64}
           0 {c |}{res}{col 17} .5666667{col 28}  .090472{col 58} .3893448{col 70} .7439886
           {txt}1 {c |}{res}{col 17} .4333333{col 28}  .090472{col 58} .2560114{col 70} .6106552
{txt}{hline 13}{c +}{hline 64}
        diff {c |}{res}{col 17} .1333333{col 28} .1279467{col 58}-.1174377{col 70} .3841044
{txt}{col 14}{c |}{col 17}under Ho:{res}{col 28} .1290994{col 38}    1.03{col 49}0.302
{txt}{hline 13}{c BT}{hline 64}
        diff = prop({res}0{txt}) - prop({res}1{txt})                                  z = {res}  1.0328
{txt}    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = {res}0.8492         {txt}Pr(|Z| > |z|) = {res}0.3017          {txt}Pr(Z > z) = {res}0.1508

{com}. *2d

. by supplement, sort : prtest cold == female

{txt}{hline}
-> supplement = 0

Two-sample test of proportions                  {res}cold{txt}: Number of obs = {res}      30
                                              female{txt}: Number of obs = {res}      30
{txt}{hline 13}{c TT}{hline 64}
    Variable{col 14}{c |}{col 22}Mean{col 29}Std. Err.{col 44}z{col 49}P>|z|{col 59}[95% Conf. Interval]
{hline 13}{c +}{hline 64}
        cold {c |}{res}{col 17} .6333333{col 28} .0879815{col 58} .4608928{col 70} .8057739
      {txt}female {c |}{res}{col 17}       .5{col 28} .0912871{col 58} .3210806{col 70} .6789194
{txt}{hline 13}{c +}{hline 64}
        diff {c |}{res}{col 17} .1333333{col 28} .1267836{col 58}-.1151579{col 70} .3818246
{txt}{col 14}{c |}{col 17}under Ho:{res}{col 28} .1279467{col 38}    1.04{col 49}0.297
{txt}{hline 13}{c BT}{hline 64}
        diff = prop({res}cold{txt}) - prop({res}female{txt})                          z = {res}  1.0421
{txt}    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = {res}0.8513         {txt}Pr(|Z| > |z|) = {res}0.2974          {txt}Pr(Z > z) = {res}0.1487

{txt}{hline}
-> supplement = 1

Two-sample test of proportions                  {res}cold{txt}: Number of obs = {res}      30
                                              female{txt}: Number of obs = {res}      30
{txt}{hline 13}{c TT}{hline 64}
    Variable{col 14}{c |}{col 22}Mean{col 29}Std. Err.{col 44}z{col 49}P>|z|{col 59}[95% Conf. Interval]
{hline 13}{c +}{hline 64}
        cold {c |}{res}{col 17} .3666667{col 28} .0879815{col 58} .1942261{col 70} .5391072
      {txt}female {c |}{res}{col 17}       .5{col 28} .0912871{col 58} .3210806{col 70} .6789194
{txt}{hline 13}{c +}{hline 64}
        diff {c |}{res}{col 17}-.1333333{col 28} .1267836{col 58}-.3818246{col 70} .1151579
{txt}{col 14}{c |}{col 17}under Ho:{res}{col 28} .1279467{col 38}   -1.04{col 49}0.297
{txt}{hline 13}{c BT}{hline 64}
        diff = prop({res}cold{txt}) - prop({res}female{txt})                          z = {res} -1.0421
{txt}    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = {res}0.1487         {txt}Pr(|Z| > |z|) = {res}0.2974          {txt}Pr(Z > z) = {res}0.8513

{com}. 
. *3a

. ttest days if cold==1, by(supplement)

{txt}Two-sample t test with equal variances
{hline 9}{c TT}{hline 68}
   Group{col 10}{c |}{col 16}Obs{col 27}Mean{col 35}Std. Err.{col 47}Std. Dev.{col 59}[95% Conf. Interval]
{hline 9}{c +}{hline 68}
       0 {c |}{res}{col 12}     19{col 22} 8.368421{col 34} .2560442{col 46} 1.116071{col 58} 7.830492{col 70}  8.90635
       {txt}1 {c |}{res}{col 12}     11{col 22}        7{col 34} .4861724{col 46} 1.612452{col 58}  5.91674{col 70}  8.08326
{txt}{hline 9}{c +}{hline 68}
combined {c |}{res}{col 12}     30{col 22} 7.866667{col 34} .2658032{col 46} 1.455864{col 58} 7.323038{col 70} 8.410295
{txt}{hline 9}{c +}{hline 68}
    diff {c |}{res}{col 22} 1.368421{col 34} .4982251{col 58} .3478532{col 70} 2.388989
{txt}{hline 9}{c BT}{hline 68}
    diff = mean({res}0{txt}) - mean({res}1{txt})                                      t = {res}  2.7466
{txt}Ho: diff = 0                                     degrees of freedom = {res}      28

    {txt}Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = {res}0.9948         {txt}Pr(|T| > |t|) = {res}0.0104          {txt}Pr(T > t) = {res}0.0052

{com}. *3b

. by female, sort : ttest days if cold==1, by(supplement)

{txt}{hline}
-> female = 0

Two-sample t test with equal variances
{hline 9}{c TT}{hline 68}
   Group{col 10}{c |}{col 16}Obs{col 27}Mean{col 35}Std. Err.{col 47}Std. Dev.{col 59}[95% Conf. Interval]
{hline 9}{c +}{hline 68}
       0 {c |}{res}{col 12}     11{col 22} 8.090909{col 34} .3681538{col 46} 1.221028{col 58} 7.270611{col 70} 8.911207
       {txt}1 {c |}{res}{col 12}      6{col 22} 6.166667{col 34} .5426274{col 46}  1.32916{col 58} 4.771799{col 70} 7.561535
{txt}{hline 9}{c +}{hline 68}
combined {c |}{res}{col 12}     17{col 22} 7.411765{col 34} .3743506{col 46} 1.543487{col 58} 6.618177{col 70} 8.205353
{txt}{hline 9}{c +}{hline 68}
    diff {c |}{res}{col 22} 1.924242{col 34} .6385125{col 58} .5632853{col 70}   3.2852
{txt}{hline 9}{c BT}{hline 68}
    diff = mean({res}0{txt}) - mean({res}1{txt})                                      t = {res}  3.0136
{txt}Ho: diff = 0                                     degrees of freedom = {res}      15

    {txt}Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = {res}0.9956         {txt}Pr(|T| > |t|) = {res}0.0087          {txt}Pr(T > t) = {res}0.0044

{txt}{hline}
-> female = 1

Two-sample t test with equal variances
{hline 9}{c TT}{hline 68}
   Group{col 10}{c |}{col 16}Obs{col 27}Mean{col 35}Std. Err.{col 47}Std. Dev.{col 59}[95% Conf. Interval]
{hline 9}{c +}{hline 68}
       0 {c |}{res}{col 12}      8{col 22}     8.75{col 34} .3133916{col 46} .8864053{col 58} 8.008947{col 70} 9.491053
       {txt}1 {c |}{res}{col 12}      5{col 22}        8{col 34} .6324555{col 46} 1.414214{col 58} 6.244022{col 70} 9.755978
{txt}{hline 9}{c +}{hline 68}
combined {c |}{res}{col 12}     13{col 22} 8.461538{col 34}  .312463{col 46} 1.126601{col 58}  7.78074{col 70} 9.142337
{txt}{hline 9}{c +}{hline 68}
    diff {c |}{res}{col 22}      .75{col 34} .6315565{col 58}-.6400465{col 70} 2.140047
{txt}{hline 9}{c BT}{hline 68}
    diff = mean({res}0{txt}) - mean({res}1{txt})                                      t = {res}  1.1875
{txt}Ho: diff = 0                                     degrees of freedom = {res}      11

    {txt}Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = {res}0.8700         {txt}Pr(|T| > |t|) = {res}0.2600          {txt}Pr(T > t) = {res}0.1300

{com}. *3c

. ttest days if cold==1, by(female)

{txt}Two-sample t test with equal variances
{hline 9}{c TT}{hline 68}
   Group{col 10}{c |}{col 16}Obs{col 27}Mean{col 35}Std. Err.{col 47}Std. Dev.{col 59}[95% Conf. Interval]
{hline 9}{c +}{hline 68}
       0 {c |}{res}{col 12}     17{col 22} 7.411765{col 34} .3743506{col 46} 1.543487{col 58} 6.618177{col 70} 8.205353
       {txt}1 {c |}{res}{col 12}     13{col 22} 8.461538{col 34}  .312463{col 46} 1.126601{col 58}  7.78074{col 70} 9.142337
{txt}{hline 9}{c +}{hline 68}
combined {c |}{res}{col 12}     30{col 22} 7.866667{col 34} .2658032{col 46} 1.455864{col 58} 7.323038{col 70} 8.410295
{txt}{hline 9}{c +}{hline 68}
    diff {c |}{res}{col 22}-1.049774{col 34} .5085647{col 58}-2.091521{col 70}-.0080261
{txt}{hline 9}{c BT}{hline 68}
    diff = mean({res}0{txt}) - mean({res}1{txt})                                      t = {res} -2.0642
{txt}Ho: diff = 0                                     degrees of freedom = {res}      28

    {txt}Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = {res}0.0242         {txt}Pr(|T| > |t|) = {res}0.0484          {txt}Pr(T > t) = {res}0.9758

{com}. *3d

. by supplement, sort : ttest days if cold==1, by(female)

{txt}{hline}
-> supplement = 0

Two-sample t test with equal variances
{hline 9}{c TT}{hline 68}
   Group{col 10}{c |}{col 16}Obs{col 27}Mean{col 35}Std. Err.{col 47}Std. Dev.{col 59}[95% Conf. Interval]
{hline 9}{c +}{hline 68}
       0 {c |}{res}{col 12}     11{col 22} 8.090909{col 34} .3681538{col 46} 1.221028{col 58} 7.270611{col 70} 8.911207
       {txt}1 {c |}{res}{col 12}      8{col 22}     8.75{col 34} .3133916{col 46} .8864053{col 58} 8.008947{col 70} 9.491053
{txt}{hline 9}{c +}{hline 68}
combined {c |}{res}{col 12}     19{col 22} 8.368421{col 34} .2560442{col 46} 1.116071{col 58} 7.830492{col 70}  8.90635
{txt}{hline 9}{c +}{hline 68}
    diff {c |}{res}{col 22}-.6590909{col 34} .5091231{col 58}-1.733247{col 70}  .415065
{txt}{hline 9}{c BT}{hline 68}
    diff = mean({res}0{txt}) - mean({res}1{txt})                                      t = {res} -1.2946
{txt}Ho: diff = 0                                     degrees of freedom = {res}      17

    {txt}Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = {res}0.1064         {txt}Pr(|T| > |t|) = {res}0.2128          {txt}Pr(T > t) = {res}0.8936

{txt}{hline}
-> supplement = 1

Two-sample t test with equal variances
{hline 9}{c TT}{hline 68}
   Group{col 10}{c |}{col 16}Obs{col 27}Mean{col 35}Std. Err.{col 47}Std. Dev.{col 59}[95% Conf. Interval]
{hline 9}{c +}{hline 68}
       0 {c |}{res}{col 12}      6{col 22} 6.166667{col 34} .5426274{col 46}  1.32916{col 58} 4.771799{col 70} 7.561535
       {txt}1 {c |}{res}{col 12}      5{col 22}        8{col 34} .6324555{col 46} 1.414214{col 58} 6.244022{col 70} 9.755978
{txt}{hline 9}{c +}{hline 68}
combined {c |}{res}{col 12}     11{col 22}        7{col 34} .4861724{col 46} 1.612452{col 58}  5.91674{col 70}  8.08326
{txt}{hline 9}{c +}{hline 68}
    diff {c |}{res}{col 22}-1.833333{col 34} .8281319{col 58}-3.706698{col 70} .0400312
{txt}{hline 9}{c BT}{hline 68}
    diff = mean({res}0{txt}) - mean({res}1{txt})                                      t = {res} -2.2138
{txt}Ho: diff = 0                                     degrees of freedom = {res}       9

    {txt}Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = {res}0.0271         {txt}Pr(|T| > |t|) = {res}0.0541          {txt}Pr(T > t) = {res}0.9729

{com}. exit
